rocktan001/LiteOS/targets/FM33LC0XX_DEMO/FM33LC0XX.SVD
<?xml version="1.0" encoding="utf-8"?>
<device xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema">
  <name>FM33LC0XX</name>
  <version>1.0</version>
  <description>ARM 32-bit Cortex SC000 Microcontroller based device</description>
  <cpu>
    <name>SC123</name>
    <version>r1p0</version>
    <endian>little</endian>
    <mpuPresent>false</mpuPresent>
    <fpuPresent>false</fpuPresent>
    <nvicPrioBits>3</nvicPrioBits>
    <vendorSystickConfig>false</vendorSystickConfig>
  </cpu>
  <addressUnitBits>8</addressUnitBits>
  <width>32</width>
  <resetValue>0x00000000</resetValue>
  <resetMask>0xFFFFFFFF</resetMask>
  <peripherals>
    <peripheral>
      <name>PMU</name>
      <description>PMU module information</description>
      <groupName>PMU</groupName>
      <baseAddress>0x40000100</baseAddress>
      <size>32</size>
      <access>read-write</access>
      <addressBlock>
        <offset>0</offset>
        <size>0x14</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>CR</name>
          <description>Power Management Control Register</description>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00060000</resetValue>
          <fields>
            <field>
              <name>LDO_LPM</name>
              <description>LDO_LPM  field description</description>
              <bitRange>[19:18]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name />
                  <description>正常模式</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description>正常模式</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description>正常模式</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description>LDO进入低功耗模式</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description>当芯片正在对FLASH擦、编程时，该寄存器无法改写为10</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LDO15EN</name>
              <description>LDO15EN  field description</description>
              <bitRange>[17:17]</bitRange>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name />
                  <description>LDO15处于工作状态</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description>LDO15被关闭</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LDO15EN_B</name>
              <description>LDO15EN_B  field description</description>
              <bitRange>[16:16]</bitRange>
              <access>read-only</access>
              <enumeratedValues />
            </field>
            <field>
              <name>WKFSEL</name>
              <description>WKFSEL  field description</description>
              <bitRange>[11:10]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name />
                  <description>RCHF-8MHz</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description>RCHF-16MHz</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description>RCHF-24MHz</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description>RFU</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SLPDP</name>
              <description>SLPDP  field description</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name />
                  <description>DeepSleep模式使能，下关闭基准电压源</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description>常规Sleep模式</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CVS</name>
              <description>CVS  field description</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name />
                  <description>低功耗模式下不使能内核电压调整</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description>低功耗模式下降低内核电压</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PMOD</name>
              <description>PMOD  field description</description>
              <bitRange>[1:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name />
                  <description>Active mode / LP Active mode</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description>LPRUN mode</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description>Sleep mode / DeepSleep mode</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description>RTCBKP mode</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>WKTR</name>
          <description>Wakeup Time Register</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xc0000001</resetValue>
          <fields>
            <field>
              <name>HDTIM</name>
              <description>HDTIM  field description</description>
              <bitRange>[31:30]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name />
                  <description>125ns</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description>250ns</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description>500ns</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description>1000ns(default)</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>STPCLR</name>
              <description>STPCLR  field description</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name />
                  <description>Stop信号等待时钟建立后同步清零</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description>Stop信号异步清零</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>T1A</name>
              <description>T1A  field description</description>
              <bitRange>[1:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name />
                  <description>0us</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description>2us</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description>4us</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description>8us</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>WKFR</name>
          <description>Wakeup Source Flags Register</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>ADCWKF</name>
              <description>ADCWKF  field description</description>
              <bitRange>[31:31]</bitRange>
              <access>read-only</access>
              <enumeratedValues />
            </field>
            <field>
              <name>RTCWKF</name>
              <description>RTCWKF  field description</description>
              <bitRange>[28:28]</bitRange>
              <access>read-only</access>
              <enumeratedValues />
            </field>
            <field>
              <name>SVDWKF</name>
              <description>SVDWKF  field description</description>
              <bitRange>[27:27]</bitRange>
              <access>read-only</access>
              <enumeratedValues />
            </field>
            <field>
              <name>LFDETWKF</name>
              <description>LFDETWKF  field description</description>
              <bitRange>[26:26]</bitRange>
              <access>read-only</access>
              <enumeratedValues />
            </field>
            <field>
              <name>VREFWKF</name>
              <description>VREFWKF  field description</description>
              <bitRange>[25:25]</bitRange>
              <access>read-only</access>
              <enumeratedValues />
            </field>
            <field>
              <name>IOWKF</name>
              <description>IOWKF  field description</description>
              <bitRange>[24:24]</bitRange>
              <access>read-only</access>
              <enumeratedValues />
            </field>
            <field>
              <name>I2CWKF</name>
              <description>I2CWKF  field description</description>
              <bitRange>[23:23]</bitRange>
              <access>read-only</access>
              <enumeratedValues />
            </field>
            <field>
              <name>LPU1WKF</name>
              <description>LPU1WKF  field description</description>
              <bitRange>[21:21]</bitRange>
              <access>read-only</access>
              <enumeratedValues />
            </field>
            <field>
              <name>LPU0WKF</name>
              <description>LPU0WKF  field description</description>
              <bitRange>[20:20]</bitRange>
              <access>read-only</access>
              <enumeratedValues />
            </field>
            <field>
              <name>COMP2WKF</name>
              <description>COMP2WKF  field description</description>
              <bitRange>[17:17]</bitRange>
              <access>read-only</access>
              <enumeratedValues />
            </field>
            <field>
              <name>COMP1WKF</name>
              <description>COMP1WKF  field description</description>
              <bitRange>[16:16]</bitRange>
              <access>read-only</access>
              <enumeratedValues />
            </field>
            <field>
              <name>LPTWKF</name>
              <description>LPTWKF  field description</description>
              <bitRange>[10:10]</bitRange>
              <access>read-only</access>
              <enumeratedValues />
            </field>
            <field>
              <name>BSTWKF</name>
              <description>BSTWKF  field description</description>
              <bitRange>[9:9]</bitRange>
              <access>read-only</access>
              <enumeratedValues />
            </field>
            <field>
              <name>DBGWKF</name>
              <description>DBGWKF  field description</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
              <enumeratedValues />
            </field>
            <field>
              <name>WKPxF</name>
              <description>WKPxF  field description</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues />
            </field>
          </fields>
        </register>
        <register>
          <name>IER</name>
          <description>PMU Interrupt Enable Register</description>
          <addressOffset>0xc</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>LPRUNEIE</name>
              <description>LPRUNEIE  field description</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name />
                  <description>使能LPRUN错误中断</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description>禁止LPRUN错误中断</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LPACTEIE</name>
              <description>LPACTEIE  field description</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name />
                  <description>使能LPACTIVE错误中断</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description>禁止LPACTIVE错误中断</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SLPEIE</name>
              <description>SLPEIE  field description</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name />
                  <description>使能SLEEP错误中断</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description>禁止SLEEP错误中断</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RTCEIE</name>
              <description>RTCEIE  field description</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name />
                  <description>使能RTCBKP错误中断</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description>禁止RTCBKP错误中断</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>ISR</name>
          <description>PMU Interrupt and Status Register</description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>LPACTEIF</name>
              <description>LPACTEIF  field description</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name />
                  <description>在LDO15LPM=1’h1后，系统时钟不符合LPACTIVE模式的定义时置位，即系统时钟为RCHF且大于4M，系统时钟为XTHF/PLL时</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description>在LDO15LPM=1’h1后，系统时钟符合LPACTIVE模式的定义</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SLPEIF</name>
              <description>SLPEIF  field description</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name />
                  <description>在PMOD=2’h2后，CPU执行WFI/WFE指令前置位了SLEEPDEEP寄存器时置位</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description>在PMOD=2’h2后，CPU正确进入SLEEP</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RTCEIF</name>
              <description>RTCEIF  field description</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name />
                  <description>在PMOD=2‘h3后，未改写CPU内部寄存器SLEEPDEEP=1，然后执行WFI/WFE指令；或者系统时钟来自USB PHY，试图进入RTCBKP模式</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description>在PMOD=2‘h3后，CPU自身正确进入DEEP SLEEP</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
