rocktan001/LiteOS/targets/FM33LC0XX_DEMO/FM33LC0XX.SVD
     </registers>
    </peripheral>     
      <peripheral>
      <name>COMP_COMMON</name>
      <description>COMP module information</description>
      <groupName>COMP</groupName>
      <baseAddress>0x0001A878</baseAddress>
      <size>32</size>
      <access>read-write</access>
      <addressBlock>
        <offset>0</offset>
        <size>0x10</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>ICR</name>
          <description>Comparator Interrupt Config Register</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CMP2DF</name>
              <description>CMP2DF  field description</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name />
                  <description>禁止数字滤波</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description>使能数字滤波</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CMP1DF</name>
              <description>CMP1DF  field description</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name />
                  <description>禁止数字滤波</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description>使能数字滤波</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CMP2SEL</name>
              <description>CMP2SEL  field description</description>
              <bitRange>[5:4]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name />
                  <description>比较器2输出上升或下降沿产生中断</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description>比较器2输出上升或下降沿产生中断</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description>比较器2输出上升沿产生中断</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description>比较器2输出下降沿产生中断</description>
                  <value>2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CMP1SEL</name>
              <description>CMP1SEL  field description</description>
              <bitRange>[3:2]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name />
                  <description>比较器1输出上升或下降沿产生中断</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description>比较器1输出上升或下降沿产生中断</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description>比较器1输出上升沿产生中断</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description>比较器1输出下降沿产生中断</description>
                  <value>2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CMP2IE</name>
              <description>CMP2IE  field description</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name />
                  <description>允许中断</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description>禁止中断</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CMP1IE</name>
              <description>CMP1IE  field description</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name />
                  <description>允许中断</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description>禁止中断</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>ISR</name>
          <description>Comparator Interrupt Status Register</description>
          <addressOffset>0xc</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CMP2IF</name>
              <description>CMP2IF  field description</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
              <enumeratedValues />
            </field>
            <field>
              <name>CMP1IF</name>
              <description>CMP1IF  field description</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues />
            </field>
          </fields>
        </register>
