rocktan001/LiteOS/targets/FM33LC0XX_DEMO/FM33LC0XX.SVD
        <register>
          <name>SMCR</name>
          <description>ATIM Slave Mode Control Register</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>ETP</name>
              <description>ETP  field description</description>
              <bitRange>[15:15]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name />
                  <description>高电平或上升沿有效</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description>低电平或下降沿有效</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ECE</name>
              <description>ECE  field description</description>
              <bitRange>[14:14]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name />
                  <description>关闭外部时钟模式2</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description>使能外部时钟模式2，计数器时钟为ETRF有效沿</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ETPS</name>
              <description>ETPS  field description</description>
              <bitRange>[13:12]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name />
                  <description>不分频</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description>2分频</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description>4分频</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description>8分频</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ETF</name>
              <description>ETF  field description</description>
              <bitRange>[11:8]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name />
                  <description>无滤波</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description>fSAMPLING=fCK_INT, N=2</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description>fSAMPLING=fCK_INT, N=4</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description>fSAMPLING=fCK_INT, N=8</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description>fSAMPLING=fDTS/2, N=6</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description>fSAMPLING=fDTS/2, N=8</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description>fSAMPLING=fDTS/4, N=6</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description>fSAMPLING=fDTS/4, N=8</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description>fSAMPLING=fDTS/8, N=6</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description>fSAMPLING=fDTS/8, N=8</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description>fSAMPLING=fDTS/16, N=5</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description>fSAMPLING=fDTS/16, N=6</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description>fSAMPLING=fDTS/16, N=8</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description>fSAMPLING=fDTS/32, N=5</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description>fSAMPLING=fDTS/32, N=6</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description>fSAMPLING=fDTS/32, N=8</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MSM</name>
              <description>MSM  field description</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name />
                  <description>无动作</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description>触发模式下，TRGI触发的动作被延迟，以便于通过TRGO实现当前定时器和从机定时器同步</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TS</name>
              <description>TS  field description</description>
              <bitRange>[6:4]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name />
                  <description>内部触发信号（ITR0）</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description>内部触发信号（ITR1）</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description>内部触发信号（ITR2）</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description>内部触发信号（ITR3）</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description>TI1边沿检测（TI1F_ED）</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description>滤波后TI1（TI1FP1）</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description>滤波后TI2（TI2FP2）</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description>外部触发输入（ETRF）</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description>仅当SMS=000即禁止从机模式的情况下，可以改写TS寄存器</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SMS</name>
              <description>SMS  field description</description>
              <bitRange>[2:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name />
                  <description>从机模式禁止；CEN使能后预分频电路时钟源来自内部时钟</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description>Encoder模式1；计数器使用TI2FP2边沿，根据TI1电平高低来计数</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description>Encoder模式2；计数器使用TI1FP1边沿，根据TI2电平高低来计数</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description>Encoder模式3；计数器同时使用TI1FP1和TI2FP2边沿，根据其他输入信号电平来计数</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description>复位模式；TRGI上升沿初始化计数器，并触发寄存器update</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description>闸门模式；TRGI为高电平时，计数时钟使能，TRGI为低电平时，计数时钟停止</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description>触发模式；TRGI上升沿触发计数器开始计数（不会复位计数器）</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description>外部时钟模式1；TRGI上升沿直接驱动计数器</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DIER</name>
          <description>ATIM DMA and Interrupt Enable Register</description>
          <addressOffset>0xc</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CC4BURSTEN</name>
              <description>CC4BURSTEN  field description</description>
              <bitRange>[19:19]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name />
                  <description>Single模式，仅访问CCR</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description>Burst模式，通过DCR配置访问的地址和长度</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CC3BURSTEN</name>
              <description>CC3BURSTEN  field description</description>
              <bitRange>[18:18]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name />
                  <description>Single模式，仅访问CCR</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description>Burst模式，通过DCR配置访问的地址和长度</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CC2BURSTEN</name>
              <description>CC2BURSTEN  field description</description>
              <bitRange>[17:17]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name />
                  <description>Single模式，仅访问CCR</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description>Burst模式，通过DCR配置访问的地址和长度</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CC1BURSTEN</name>
              <description>CC1BURSTEN  field description</description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name />
                  <description>Single模式，仅访问CCR</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description>Burst模式，通过DCR配置访问的地址和长度</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TDE</name>
              <description>TDE  field description</description>
              <bitRange>[14:14]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name />
                  <description>从机模式下，禁止外部触发事件产生DMA请求</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description>从机模式下，允许外部触发事件产生DMA请求（可用于自动更新preload寄存器）</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>COMDE</name>
              <description>COMDE  field description</description>
              <bitRange>[13:13]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name />
                  <description>COM事件发生时，禁止产生DMA请求</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description>COM事件发生时，允许产生DMA请求</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CC4DE</name>
              <description>CC4DE  field description</description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name />
                  <description>禁止CC4 DMA请求</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description>允许CC4 DMA请求</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CC3DE</name>
              <description>CC3DE  field description</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name />
                  <description>禁止CC3 DMA请求</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description>允许CC3 DMA请求</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CC2DE</name>
              <description>CC2DE  field description</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name />
                  <description>禁止CC2 DMA请求</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description>允许CC2 DMA请求</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CC1DE</name>
              <description>CC1DE  field description</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name />
                  <description>禁止CC1 DMA请求</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description>允许CC1 DMA请求</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>UDE</name>
              <description>UDE  field description</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name />
                  <description>Update Event发生时，禁止产生DMA请求</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description>Update Event发生时，允许产生DMA请求</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BIE</name>
              <description>BIE  field description</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name />
                  <description>禁止刹车事件中断</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description>允许刹车事件中断</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TIE</name>
              <description>TIE  field description</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name />
                  <description>禁止触发事件中断</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description>允许触发事件中断</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>COMIE</name>
              <description>COMIE  field description</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name />
                  <description>禁止COM事件中断</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description>允许COM事件中断</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CC4IE</name>
              <description>CC4IE  field description</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name />
                  <description>禁止捕捉/比较4中断</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description>允许捕捉/比较4中断</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CC3IE</name>
              <description>CC3IE  field description</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name />
                  <description>禁止捕捉/比较3中断</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description>允许捕捉/比较3中断</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CC2IE</name>
              <description>CC2IE  field description</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name />
                  <description>禁止捕捉/比较2中断</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description>允许捕捉/比较2中断</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CC1IE</name>
              <description>CC1IE  field description</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name />
                  <description>禁止捕捉/比较1中断</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description>允许捕捉/比较1中断</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>UIE</name>
              <description>UIE  field description</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name />
                  <description>禁止Update事件中断</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description>允许Update事件中断</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
