rocktan001/LiteOS/targets/FM33LC0XX_DEMO/FM33LC0XX.SVD
        <register>
          <name>ARR</name>
          <description>ATIM Auto-Reload Register</description>
          <addressOffset>0x2c</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>ARR</name>
              <description>ARR  field description</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues />
            </field>
          </fields>
        </register>
        <register>
          <name>RCR</name>
          <description>ATIM Repetition Counter Register</description>
          <addressOffset>0x30</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>REP</name>
              <description>REP  field description</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues />
            </field>
          </fields>
        </register>
        <register>
          <name>CCR1</name>
          <description>ATIM Capture/Compare Register1</description>
          <addressOffset>0x34</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CCR1</name>
              <description>CCR1  field description</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name />
                  <description />
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description />
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CCR2</name>
          <description>ATIM Capture/Compare Register2</description>
          <addressOffset>0x38</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CCR2</name>
              <description>CCR2  field description</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name />
                  <description />
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description />
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CCR3</name>
          <description>ATIM Capture/Compare Register3</description>
          <addressOffset>0x3c</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CCR3</name>
              <description>CCR3  field description</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name />
                  <description />
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description />
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CCR4</name>
          <description>ATIM Capture/Compare Register4</description>
          <addressOffset>0x40</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CCR4</name>
              <description>CCR4  field description</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name />
                  <description />
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description />
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>BDTR</name>
          <description>ATIM Break and Deadtime Register</description>
          <addressOffset>0x44</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>MOE</name>
              <description>MOE  field description</description>
              <bitRange>[15:15]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name />
                  <description>关闭OC和OCN输出，具体IO输出状态由OSSI决定</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description>使能OC和OCN输出（仍需各个通道的CcxE和CcxNE状态来决定是否输出）</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>AOE</name>
              <description>AOE  field description</description>
              <bitRange>[14:14]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name />
                  <description>MOE仅能由软件置位</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description>MOE可以软件置位，或者由update事件自动置位</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BKP</name>
              <description>BKP  field description</description>
              <bitRange>[13:13]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name />
                  <description>刹车输入为低电平有效</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description>刹车输入为高电平有效</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BKE</name>
              <description>BKE  field description</description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name />
                  <description>禁止刹车输入</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description>允许刹车输入</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OSSR</name>
              <description>OSSR  field description</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name />
                  <description>输出通道不使能时，OC和OCN不驱动GPIO</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description>输出通道不使能时，OC和OCN驱动GPIO为无效状态</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OSSI</name>
              <description>OSSI  field description</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name />
                  <description>输出通道不使能时，OC和OCN不驱动GPIO</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description>输出通道不使能时，OC和OCN先驱动空闲状态，待死区时间结束后，启动无效状态</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LOCK</name>
              <description>LOCK  field description</description>
              <bitRange>[9:8]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name />
                  <description>无写保护</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description>保护等级1 – DTG, OISx, OISxN, BKE, BKP, AOE不能改写</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description>保护等级2 –在等级1基础上，CCxP, CCxNP, OSSR, OSSI不能改写</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description>保护等级3 –在等级2基础上，OcxM, OcxPE在相应通道配置为输出时不能改写</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description>LOCK寄存器在被写入非00值之后无法再改写，写保护后的寄存器只有在ATIM模块被复位后才能重新写入。</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DTG</name>
              <description>DTG  field description</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name />
                  <description>DT=DTG[7:0] * tDTS</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description>DT=DTG[7:0] * tDTS</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description>DT=DTG[7:0] * tDTS</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description>DT=DTG[7:0] * tDTS</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description>DT=(64+DTG[5:0]) * 2 * tDTS</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description>DT=(64+DTG[5:0]) * 2 * tDTS</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description>DT=(32+DTG[4:0]) * 8 * tDTS</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description>DT=(32+DTG[4:0]) * 16 * tDTS</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DCR</name>
          <description>ATIM DMA Control Register</description>
          <addressOffset>0x48</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DBL</name>
              <description>DBL  field description</description>
              <bitRange>[12:8]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name />
                  <description>长度=1</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description>长度=2</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description>长度=3</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description>长度=4</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description>长度=5</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description>长度=6</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description>长度=7</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description>长度=8</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description>长度=9</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description>长度=10</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description>长度=11</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description>长度=12</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description>长度=13</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description>长度=14</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description>长度=15</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description>长度=16</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description>长度=17</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description>长度=18</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description>无效值，禁止写入</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DBA</name>
              <description>DBA  field description</description>
              <bitRange>[4:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name />
                  <description>ATIM_CR1</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description>ATIM_CR2</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description>ATIM_SMCR</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description>当DBA+DBL超出了ATIM寄存器地址范围，则实际burst传输到ATIM最高寄存器地址后自动停止，即burst长度会缩短。</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DMAR</name>
          <description>ATIM DMA Access Register</description>
          <addressOffset>0x4c</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DMAR</name>
              <description>DMAR  field description</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues />
            </field>
          </fields>
        </register>
