rocktan001/LiteOS/targets/FM33LC0XX_DEMO/FM33LC0XX.SVD
        <register>
          <name>CCER</name>
          <description>GPTIM0 Capture/Compare Enable Register</description>
          <addressOffset>0x20</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CC4P</name>
              <description>CC4P  field description</description>
              <bitRange>[13:13]</bitRange>
              <access>read-write</access>
              <enumeratedValues />
            </field>
            <field>
              <name>CC4E</name>
              <description>CC4E  field description</description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>
              <enumeratedValues />
            </field>
            <field>
              <name>CC3P</name>
              <description>CC3P  field description</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
              <enumeratedValues />
            </field>
            <field>
              <name>CC3E</name>
              <description>CC3E  field description</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
              <enumeratedValues />
            </field>
            <field>
              <name>CC2P</name>
              <description>CC2P  field description</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
              <enumeratedValues />
            </field>
            <field>
              <name>CC2E</name>
              <description>CC2E  field description</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
              <enumeratedValues />
            </field>
            <field>
              <name>CC1P</name>
              <description>CC1P  field description</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name />
                  <description />
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description>OC1高有效</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description>OC1低有效</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description />
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description>非取反/上升沿</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description>取反/下降沿</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description>保留，不要使用</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description>非取反，上下沿都有效</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CC1E</name>
              <description>CC1E  field description</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name />
                  <description>OC1输出关闭，Ocx=0，Ocx_EN=0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description>Ocx=OCxREF+极性选择，Ocx_EN=1</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description>关闭捕捉功能</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description>使能捕捉功能</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CNT</name>
          <description>GPTIM0 Counter Register</description>
          <addressOffset>0x24</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CNT</name>
              <description>CNT  field description</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues />
            </field>
          </fields>
        </register>
        <register>
          <name>PSC</name>
          <description>GPTIM0 Prescaler Register</description>
          <addressOffset>0x28</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PSC</name>
              <description>PSC  field description</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues />
            </field>
          </fields>
        </register>
        <register>
          <name>ARR</name>
          <description>GPTIM0 Auto-Reload Register</description>
          <addressOffset>0x2c</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>ARR</name>
              <description>ARR  field description</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues />
            </field>
          </fields>
        </register>
        <register>
          <name>CCR1</name>
          <description>GPTIM0 Capture/Compare Register1</description>
          <addressOffset>0x34</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CCR1</name>
              <description>CCR1  field description</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name />
                  <description />
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description />
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CCR2</name>
          <description>GPTIM0 Capture/Compare Register2</description>
          <addressOffset>0x38</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CCR2</name>
              <description>CCR2  field description</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name />
                  <description />
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description />
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CCR3</name>
          <description>GPTIM0 Capture/Compare Register3</description>
          <addressOffset>0x3c</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CCR3</name>
              <description>CCR3  field description</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name />
                  <description />
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description />
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CCR4</name>
          <description>GPTIM0 Capture/Compare Register4</description>
          <addressOffset>0x40</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CCR4</name>
              <description>CCR4  field description</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name />
                  <description />
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description />
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DCR</name>
          <description>GPTIM0 DMA Control Register</description>
          <addressOffset>0x48</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DBL</name>
              <description>DBL  field description</description>
              <bitRange>[12:8]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name />
                  <description>长度=1</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description>长度=2</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description>长度=3</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description>长度=4</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description>长度=5</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description>长度=6</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description>长度=7</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description>长度=8</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description>长度=9</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description>长度=10</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description>长度=11</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description>长度=12</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description>长度=13</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description>长度=14</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description>长度=15</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description>长度=16</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description>长度=17</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description>长度=18</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description>无效值，禁止写入</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DBA</name>
              <description>DBA  field description</description>
              <bitRange>[4:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name />
                  <description>GPTIM_CR1</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description>GPTIM_CR2</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description>GPTIM_SMCR</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description>当DBA+DBL超出了GPTIM寄存器地址范围，则实际burst传输到GPTIM最高寄存器地址后自动停止，即burst长度会缩短。</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DMAR</name>
          <description>GPTIM0 DMA access Register</description>
          <addressOffset>0x4c</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DMAR</name>
              <description>DMAR  field description</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues />
            </field>
          </fields>
        </register>
        <register>
          <name>ITRSEL</name>
          <description>GPTIM0 Internal Trigger Select Register</description>
          <addressOffset>0x60</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>ITR3SEL</name>
              <description>ITR3SEL  field description</description>
              <bitRange>[7:6]</bitRange>
              <access>read-write</access>
              <enumeratedValues />
            </field>
            <field>
              <name>ITR2SEL</name>
              <description>ITR2SEL  field description</description>
              <bitRange>[5:4]</bitRange>
              <access>read-write</access>
              <enumeratedValues />
            </field>
            <field>
              <name>ITR1SEL</name>
              <description>ITR1SEL  field description</description>
              <bitRange>[3:2]</bitRange>
              <access>read-write</access>
              <enumeratedValues />
            </field>
            <field>
              <name>ITR0SEL</name>
              <description>ITR0SEL  field description</description>
              <bitRange>[1:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues />
            </field>
          </fields>
        </register>
