rocktan001/LiteOS/targets/FM33LC0XX_DEMO/FM33LC0XX.SVD
        <register>
          <name>DCFG</name>
          <description>USB Device Config Register</description>
          <addressOffset>0x800</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>ResValid</name>
              <description>ResValid  field description</description>
              <bitRange>[31:26]</bitRange>
              <access>read-write</access>
              <enumeratedValues />
            </field>
            <field>
              <name>EPMisCnt</name>
              <description>EPMisCnt  field description</description>
              <bitRange>[22:18]</bitRange>
              <access>read-write</access>
              <enumeratedValues />
            </field>
            <field>
              <name>PerFrInt</name>
              <description>PerFrInt  field description</description>
              <bitRange>[12:11]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name />
                  <description>80%帧周期</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description>85%帧周期</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description>90%帧周期</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description>95%帧周期</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DevAddr</name>
              <description>DevAddr  field description</description>
              <bitRange>[10:4]</bitRange>
              <access>read-write</access>
              <enumeratedValues />
            </field>
            <field>
              <name>En32KS</name>
              <description>En32KS  field description</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
              <enumeratedValues />
            </field>
            <field>
              <name>NZStsOUTHShk</name>
              <description>NZStsOUTHShk  field description</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name />
                  <description>将收到的OUT包传递给软件，并且根据设备端点控制寄存器中的NAK和STALL位来产生合适的握手</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description>回发STALL握手，并且不把收到的OUT包发给软件</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DevSpd</name>
              <description>DevSpd  field description</description>
              <bitRange>[1:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues />
            </field>
          </fields>
        </register>
        <register>
          <name>DCTL</name>
          <description>USB Device Control Register</description>
          <addressOffset>0x804</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>NakOnBble</name>
              <description>NakOnBble  field description</description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>
              <enumeratedValues />
            </field>
            <field>
              <name>PWROnPrgDone</name>
              <description>PWROnPrgDone  field description</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>
              <enumeratedValues />
            </field>
            <field>
              <name>CGOUTNak</name>
              <description>CGOUTNak  field description</description>
              <bitRange>[10:10]</bitRange>
              <access>write-only</access>
              <enumeratedValues />
            </field>
            <field>
              <name>SGOUTNak</name>
              <description>SGOUTNak  field description</description>
              <bitRange>[9:9]</bitRange>
              <access>write-only</access>
              <enumeratedValues />
            </field>
            <field>
              <name>CGNPInNak</name>
              <description>CGNPInNak  field description</description>
              <bitRange>[8:8]</bitRange>
              <access>write-only</access>
              <enumeratedValues />
            </field>
            <field>
              <name>SGNPInNak</name>
              <description>SGNPInNak  field description</description>
              <bitRange>[7:7]</bitRange>
              <access>write-only</access>
              <enumeratedValues />
            </field>
            <field>
              <name>TstCtl</name>
              <description>TstCtl  field description</description>
              <bitRange>[6:4]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name />
                  <description>测试模式禁止</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description>测试J模式输出</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description>测试K模式输出</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description>测试SE0_NAK模式输出</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description>测试包模式</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description>测试Force使能</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description>保留</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>GOUTNakSts</name>
              <description>GOUTNakSts  field description</description>
              <bitRange>[3:3]</bitRange>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name />
                  <description>根据RxFIFO状态和NAK、STALL位设置决定握手形式</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description>数据不会写入RxFIFO，收到所有数据包都回发NAK，除了SETUP</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>GNPINNakSts</name>
              <description>GNPINNakSts  field description</description>
              <bitRange>[2:2]</bitRange>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name />
                  <description>根据TxFIFO状态回发握手</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description>在所有Non-Periodic IN端点上发送NAK</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SftDisc</name>
              <description>SftDisc  field description</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
              <enumeratedValues />
            </field>
            <field>
              <name>RmtWkUpSig</name>
              <description>RmtWkUpSig  field description</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues />
            </field>
          </fields>
        </register>
        <register>
          <name>DSTS</name>
          <description>USB Device Status Register</description>
          <addressOffset>0x808</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000002</resetValue>
          <fields>
            <field>
              <name>SOFFN</name>
              <description>SOFFN  field description</description>
              <bitRange>[21:8]</bitRange>
              <access>read-only</access>
              <enumeratedValues />
            </field>
            <field>
              <name>ErrticErr</name>
              <description>ErrticErr  field description</description>
              <bitRange>[3:3]</bitRange>
              <access>read-only</access>
              <enumeratedValues />
            </field>
            <field>
              <name>EnumSpd</name>
              <description>EnumSpd  field description</description>
              <bitRange>[2:1]</bitRange>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name />
                  <description>HS</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description>FS，PHY_CLK为30或60M</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description>LS</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description>FS，PHY_CLK为48M</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SuspSts</name>
              <description>SuspSts  field description</description>
              <bitRange>[0:0]</bitRange>
              <access>read-only</access>
              <enumeratedValues />
            </field>
          </fields>
        </register>
        <register>
          <name>DIEPMSK</name>
          <description>USB Device In Endpoint Interrupt Mask Register</description>
          <addressOffset>0x810</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>NakMsk</name>
              <description>NakMsk  field description</description>
              <bitRange>[13:13]</bitRange>
              <access>read-write</access>
              <enumeratedValues />
            </field>
            <field>
              <name>BNAIntMsk</name>
              <description>BNAIntMsk  field description</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
              <enumeratedValues />
            </field>
            <field>
              <name>TxFUndrnMsk</name>
              <description>TxFUndrnMsk  field description</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
              <enumeratedValues />
            </field>
            <field>
              <name>INEPNakEffMsk</name>
              <description>INEPNakEffMsk  field description</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
              <enumeratedValues />
            </field>
            <field>
              <name>INTknEPMisMsk</name>
              <description>INTknEPMisMsk  field description</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
              <enumeratedValues />
            </field>
            <field>
              <name>INTknTxFEmpMsk</name>
              <description>INTknTxFEmpMsk  field description</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
              <enumeratedValues />
            </field>
            <field>
              <name>TimeOutMsk</name>
              <description>TimeOutMsk  field description</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
              <enumeratedValues />
            </field>
            <field>
              <name>AHBErrMsk</name>
              <description>AHBErrMsk  field description</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
              <enumeratedValues />
            </field>
            <field>
              <name>EPDisbldMsk</name>
              <description>EPDisbldMsk  field description</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
              <enumeratedValues />
            </field>
            <field>
              <name>XferComplMsk</name>
              <description>XferComplMsk  field description</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues />
            </field>
          </fields>
        </register>
        <register>
          <name>DOEPMSK</name>
          <description>USB Device OUT Endpoint Interrupt Mask Registe</description>
          <addressOffset>0x814</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>NYETMsk</name>
              <description>NYETMsk  field description</description>
              <bitRange>[14:14]</bitRange>
              <access>read-write</access>
              <enumeratedValues />
            </field>
            <field>
              <name>NakMsk</name>
              <description>NakMsk  field description</description>
              <bitRange>[13:13]</bitRange>
              <access>read-write</access>
              <enumeratedValues />
            </field>
            <field>
              <name>BbleErrMsk</name>
              <description>BbleErrMsk  field description</description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>
              <enumeratedValues />
            </field>
            <field>
              <name>BnaOutIntMsk</name>
              <description>BnaOutIntMsk  field description</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
              <enumeratedValues />
            </field>
            <field>
              <name>OutPktErrMsk</name>
              <description>OutPktErrMsk  field description</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
              <enumeratedValues />
            </field>
            <field>
              <name>B2Bsetup</name>
              <description>B2Bsetup  field description</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
              <enumeratedValues />
            </field>
            <field>
              <name>OutTknEPdisMsk</name>
              <description>OutTknEPdisMsk  field description</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
              <enumeratedValues />
            </field>
            <field>
              <name>SetupMsk</name>
              <description>SetupMsk  field description</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
              <enumeratedValues />
            </field>
            <field>
              <name>AHBErrMsk</name>
              <description>AHBErrMsk  field description</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
              <enumeratedValues />
            </field>
            <field>
              <name>EPDisbldMsk</name>
              <description>EPDisbldMsk  field description</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
              <enumeratedValues />
            </field>
            <field>
              <name>XferComplMsk</name>
              <description>XferComplMsk  field description</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues />
            </field>
          </fields>
        </register>
        <register>
          <name>DAINTMSK</name>
          <description>USB Device All Endpoint Interrupt Mask Register</description>
          <addressOffset>0x81c</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>OutEPMsk</name>
              <description>OutEPMsk  field description</description>
              <bitRange>[31:16]</bitRange>
              <access>read-write</access>
              <enumeratedValues />
            </field>
            <field>
              <name>InEPMsk</name>
              <description>InEPMsk  field description</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues />
            </field>
          </fields>
        </register>
        <register>
          <name>DIEPEMPMSK</name>
          <description>USB Device IN endpoint FIFO empty interrupt Mask Register</description>
          <addressOffset>0x834</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>InEpTxfEmpMsk</name>
              <description>InEpTxfEmpMsk  field description</description>
              <bitRange>[2:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name />
                  <description>IN端点0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description>IN端点1</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description>IN端点2</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DIEPCTL0</name>
          <description>USB Device In Endpoint 0 Control Register</description>
          <addressOffset>0x900</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00008000</resetValue>
          <fields>
            <field>
              <name>EPEna</name>
              <description>EPEna  field description</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access>
              <enumeratedValues />
            </field>
            <field>
              <name>EPDis</name>
              <description>EPDis  field description</description>
              <bitRange>[30:30]</bitRange>
              <access>read-write</access>
              <enumeratedValues />
            </field>
            <field>
              <name>SNAK</name>
              <description>SNAK  field description</description>
              <bitRange>[27:27]</bitRange>
              <access>write-only</access>
              <enumeratedValues />
            </field>
            <field>
              <name>CNAK</name>
              <description>CNAK  field description</description>
              <bitRange>[26:26]</bitRange>
              <access>write-only</access>
              <enumeratedValues />
            </field>
            <field>
              <name>TxFNum</name>
              <description>TxFNum  field description</description>
              <bitRange>[25:22]</bitRange>
              <access>read-write</access>
              <enumeratedValues />
            </field>
            <field>
              <name>Stall</name>
              <description>Stall  field description</description>
              <bitRange>[21:21]</bitRange>
              <access>read-write</access>
              <enumeratedValues />
            </field>
            <field>
              <name>EPType</name>
              <description>EPType  field description</description>
              <bitRange>[19:18]</bitRange>
              <access>read-only</access>
              <enumeratedValues />
            </field>
            <field>
              <name>NAKSts</name>
              <description>NAKSts  field description</description>
              <bitRange>[17:17]</bitRange>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name />
                  <description>控制器根据FIFO状态来回发非NAK握手包</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description>控制器回发NAK</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>USBActEP</name>
              <description>USBActEP  field description</description>
              <bitRange>[15:15]</bitRange>
              <access>read-only</access>
              <enumeratedValues />
            </field>
            <field>
              <name>NxtEP</name>
              <description>NxtEP  field description</description>
              <bitRange>[14:11]</bitRange>
              <access>read-write</access>
              <enumeratedValues />
            </field>
            <field>
              <name>MPS</name>
              <description>MPS  field description</description>
              <bitRange>[1:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name />
                  <description>64bytes</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description>32bytes</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description>16bytes</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description>8bytes</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
