rocktan001/LiteOS/targets/FM33LC0XX_DEMO/FM33LC0XX.SVD
        <register>
          <name>DIEPINT0</name>
          <description>USB Device In Endpoint 0 Interrupt Register</description>
          <addressOffset>0x908</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>NYETInt</name>
              <description>NYETInt  field description</description>
              <bitRange>[14:14]</bitRange>
              <access>read-write</access>
              <enumeratedValues />
            </field>
            <field>
              <name>NAKInt</name>
              <description>NAKInt  field description</description>
              <bitRange>[13:13]</bitRange>
              <access>read-write</access>
              <enumeratedValues />
            </field>
            <field>
              <name>BbleErrInt</name>
              <description>BbleErrInt  field description</description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>
              <enumeratedValues />
            </field>
            <field>
              <name>PktDrpSts</name>
              <description>PktDrpSts  field description</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>
              <enumeratedValues />
            </field>
            <field>
              <name>TxFEmp</name>
              <description>TxFEmp  field description</description>
              <bitRange>[7:7]</bitRange>
              <access>read-only</access>
              <enumeratedValues />
            </field>
            <field>
              <name>INEPNakEff</name>
              <description>INEPNakEff  field description</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
              <enumeratedValues />
            </field>
            <field>
              <name>EPDisbld</name>
              <description>EPDisbld  field description</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
              <enumeratedValues />
            </field>
            <field>
              <name>XferCompl</name>
              <description>XferCompl  field description</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues />
            </field>
          </fields>
        </register>
        <register>
          <name>DIEPTSIZ0</name>
          <description>USB Device IN Endpoint 0 Transfer Size Register</description>
          <addressOffset>0x910</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PktCnt</name>
              <description>PktCnt  field description</description>
              <bitRange>[20:19]</bitRange>
              <access>read-write</access>
              <enumeratedValues />
            </field>
            <field>
              <name>XferSize</name>
              <description>XferSize  field description</description>
              <bitRange>[6:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues />
            </field>
          </fields>
        </register>
        <register>
          <name>DIEPCTL1</name>
          <description>USB Device In Endpoint 1 Control Register</description>
          <addressOffset>0x920</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00008000</resetValue>
          <fields>
            <field>
              <name>EPEna</name>
              <description>EPEna  field description</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access>
              <enumeratedValues />
            </field>
            <field>
              <name>EPDis</name>
              <description>EPDis  field description</description>
              <bitRange>[30:30]</bitRange>
              <access>read-write</access>
              <enumeratedValues />
            </field>
            <field>
              <name>SNAK</name>
              <description>SNAK  field description</description>
              <bitRange>[27:27]</bitRange>
              <access>write-only</access>
              <enumeratedValues />
            </field>
            <field>
              <name>CNAK</name>
              <description>CNAK  field description</description>
              <bitRange>[26:26]</bitRange>
              <access>write-only</access>
              <enumeratedValues />
            </field>
            <field>
              <name>TxFNum</name>
              <description>TxFNum  field description</description>
              <bitRange>[25:22]</bitRange>
              <access>read-write</access>
              <enumeratedValues />
            </field>
            <field>
              <name>Stall</name>
              <description>Stall  field description</description>
              <bitRange>[21:21]</bitRange>
              <access>read-write</access>
              <enumeratedValues />
            </field>
            <field>
              <name>Snp</name>
              <description>Snp  field description</description>
              <bitRange>[20:20]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name />
                  <description>控制器不检查收到的OUT数据包的正确性</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description>控制器检查OUT数据包正确性</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EPType</name>
              <description>EPType  field description</description>
              <bitRange>[19:18]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name />
                  <description>Control</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description>Isochronous</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description>Bulk</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description>Interrupt</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>NAKSts</name>
              <description>NAKSts  field description</description>
              <bitRange>[17:17]</bitRange>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name />
                  <description>控制器根据FIFO状态来回发非NAK握手包</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description>控制器回发NAK</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DPID</name>
              <description>DPID  field description</description>
              <bitRange>[16:16]</bitRange>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name />
                  <description />
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description />
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description>DATA0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description>DATA1</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description />
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description>偶数帧</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description>奇数帧</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>USBActEP</name>
              <description>USBActEP  field description</description>
              <bitRange>[15:15]</bitRange>
              <access>read-only</access>
              <enumeratedValues />
            </field>
            <field>
              <name>MPS</name>
              <description>MPS  field description</description>
              <bitRange>[10:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues />
            </field>
          </fields>
        </register>
        <register>
          <name>DIEPINT1</name>
          <description>USB Device In Endpoint 1 Interrupt Register</description>
          <addressOffset>0x928</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>NYETInt</name>
              <description>NYETInt  field description</description>
              <bitRange>[14:14]</bitRange>
              <access>read-write</access>
              <enumeratedValues />
            </field>
            <field>
              <name>NAKInt</name>
              <description>NAKInt  field description</description>
              <bitRange>[13:13]</bitRange>
              <access>read-write</access>
              <enumeratedValues />
            </field>
            <field>
              <name>BbleErrInt</name>
              <description>BbleErrInt  field description</description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>
              <enumeratedValues />
            </field>
            <field>
              <name>PktDrpSts</name>
              <description>PktDrpSts  field description</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>
              <enumeratedValues />
            </field>
            <field>
              <name>TxFEmp</name>
              <description>TxFEmp  field description</description>
              <bitRange>[7:7]</bitRange>
              <access>read-only</access>
              <enumeratedValues />
            </field>
            <field>
              <name>INEPNakEff</name>
              <description>INEPNakEff  field description</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
              <enumeratedValues />
            </field>
            <field>
              <name>EPDisbld</name>
              <description>EPDisbld  field description</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
              <enumeratedValues />
            </field>
            <field>
              <name>XferCompl</name>
              <description>XferCompl  field description</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues />
            </field>
          </fields>
        </register>
        <register>
          <name>DIEPTSIZ1</name>
          <description>USB Device IN Endpoint 1 Transfer Size Register</description>
          <addressOffset>0x930</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>MC</name>
              <description>MC  field description</description>
              <bitRange>[30:29]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name />
                  <description>1 packet</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description>2 packets</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description>3 packets</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PktCnt</name>
              <description>PktCnt  field description</description>
              <bitRange>[28:19]</bitRange>
              <access>read-write</access>
              <enumeratedValues />
            </field>
            <field>
              <name>XferSize</name>
              <description>XferSize  field description</description>
              <bitRange>[18:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues />
            </field>
          </fields>
        </register>
        <register>
          <name>DIEPCTL2</name>
          <description>USB Device In Endpoint 2 Control Register</description>
          <addressOffset>0x940</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00008000</resetValue>
          <fields>
            <field>
              <name>EPEna</name>
              <description>EPEna  field description</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access>
              <enumeratedValues />
            </field>
            <field>
              <name>EPDis</name>
              <description>EPDis  field description</description>
              <bitRange>[30:30]</bitRange>
              <access>read-write</access>
              <enumeratedValues />
            </field>
            <field>
              <name>SNAK</name>
              <description>SNAK  field description</description>
              <bitRange>[27:27]</bitRange>
              <access>write-only</access>
              <enumeratedValues />
            </field>
            <field>
              <name>CNAK</name>
              <description>CNAK  field description</description>
              <bitRange>[26:26]</bitRange>
              <access>write-only</access>
              <enumeratedValues />
            </field>
            <field>
              <name>TxFNum</name>
              <description>TxFNum  field description</description>
              <bitRange>[25:22]</bitRange>
              <access>read-write</access>
              <enumeratedValues />
            </field>
            <field>
              <name>Stall</name>
              <description>Stall  field description</description>
              <bitRange>[21:21]</bitRange>
              <access>read-write</access>
              <enumeratedValues />
            </field>
            <field>
              <name>Snp</name>
              <description>Snp  field description</description>
              <bitRange>[20:20]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name />
                  <description>控制器不检查收到的OUT数据包的正确性</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description>控制器检查OUT数据包正确性</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EPType</name>
              <description>EPType  field description</description>
              <bitRange>[19:18]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name />
                  <description>Control</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description>Isochronous</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description>Bulk</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description>Interrupt</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>NAKSts</name>
              <description>NAKSts  field description</description>
              <bitRange>[17:17]</bitRange>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name />
                  <description>控制器根据FIFO状态来回发非NAK握手包</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description>控制器回发NAK</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DPID</name>
              <description>DPID  field description</description>
              <bitRange>[16:16]</bitRange>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name />
                  <description />
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description />
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description>DATA0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description>DATA1</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description />
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description>偶数帧</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name />
                  <description>奇数帧</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>USBActEP</name>
              <description>USBActEP  field description</description>
              <bitRange>[15:15]</bitRange>
              <access>read-only</access>
              <enumeratedValues />
            </field>
            <field>
              <name>MPS</name>
              <description>MPS  field description</description>
              <bitRange>[10:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues />
            </field>
          </fields>
        </register>
        <register>
          <name>DIEPINT2</name>
          <description>USB Device In Endpoint 2 Interrupt Register</description>
          <addressOffset>0x948</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>NYETInt</name>
              <description>NYETInt  field description</description>
              <bitRange>[14:14]</bitRange>
              <access>read-write</access>
              <enumeratedValues />
            </field>
            <field>
              <name>NAKInt</name>
              <description>NAKInt  field description</description>
              <bitRange>[13:13]</bitRange>
              <access>read-write</access>
              <enumeratedValues />
            </field>
            <field>
              <name>BbleErrInt</name>
              <description>BbleErrInt  field description</description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>
              <enumeratedValues />
            </field>
            <field>
              <name>PktDrpSts</name>
              <description>PktDrpSts  field description</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>
              <enumeratedValues />
            </field>
            <field>
              <name>TxFEmp</name>
              <description>TxFEmp  field description</description>
              <bitRange>[7:7]</bitRange>
              <access>read-only</access>
              <enumeratedValues />
            </field>
            <field>
              <name>INEPNakEff</name>
              <description>INEPNakEff  field description</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
              <enumeratedValues />
            </field>
            <field>
              <name>EPDisbld</name>
              <description>EPDisbld  field description</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
              <enumeratedValues />
            </field>
            <field>
              <name>XferCompl</name>
              <description>XferCompl  field description</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues />
            </field>
          </fields>
        </register>
